# Python ki Pandas library

In [111]:
#1 libraries import
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [112]:
#2 data import
df=sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [113]:
#3 data explore 
df.head() #first five rows

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [114]:
#3.1 tail
df.tail() # last five rows

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [115]:
#3.2 info 
df.dtypes # data types

#  please find the differnce between 8, 16, 32 and 64 bits or why int64?

#  What does Int64 mean? Ans: Int64 is an immutable value type that represents signed integers with values that range 
# from negative 9,223,372,036,854,775,808 (which is represented by the Int64. MinValue constant) through positive
#  9,223,372,036,854,775,807 (which is represented by the Int64. MaxValue constant.
#What is the difference between 16 32 and 64-bit? Answer: In computing, 32-bit and 64-bit are two different types of processors
# The bit number (usually 8, 16, 32, or 64) refers to how much memory a processor can access from the CPU register. Most
#  computers made in the 1990s and early 200s were 32-bit machines.

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [116]:
#3.3 describe 
df.describe() # summary statistics: 5 numeric values or in pr hi stat lgti hy

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [117]:
#3.4 shape 
df.shape # number of rows and col

(891, 15)

In [118]:
#3.5  columns
df.columns #column names to have exact spellings of columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [119]:
#3.6 index
df.index #index names

RangeIndex(start=0, stop=891, step=1)

In [120]:
#3.7 inforamtion
df.info() #data types and number of non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [121]:
#3.8 unique
df.nunique() #number of unique values in each column

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [122]:
#3.9 value_counts
df.count() # number of non-null values in each column 
#this can be done via info function

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [123]:
#3.10 value_counts
df.value_counts() #number of unique values in each column
#sns.load_dataset('iris')

survived  pclass  sex     age   sibsp  parch  fare      embarked  class  who    adult_male  deck  embark_town  alive  alone
1         1       female  24.0  0      0      69.3000   C         First  woman  False       B     Cherbourg    yes    True     2
                          58.0  0      0      26.5500   S         First  woman  False       C     Southampton  yes    True     1
                          49.0  0      0      25.9292   S         First  woman  False       D     Southampton  yes    True     1
                                1      0      76.7292   C         First  woman  False       D     Cherbourg    yes    False    1
                          50.0  0      1      247.5208  C         First  woman  False       B     Cherbourg    yes    False    1
                                                                                                                              ..
                          16.0  0      0      86.5000   S         First  woman  False       B     Southampton  yes    True     1
                                       1      39.4000   S         First  woman  False       D     Southampton  yes    False    1
                                              57.9792   C         First  woman  False       B     Cherbourg    yes    False    1
                          17.0  1      0      57.0000   S         First  woman  False       B     Southampton  yes    False    1
          3       male    32.0  0      0      8.0500    S         Third  man    True        E     Southampton  yes    True     1
Length: 181, dtype: int64

In [124]:
# 4 data cleaning
#4.1 selection
df.select_dtypes(include='number') # select only numeric columns

     survived  pclass   age  sibsp  parch     fare
0           0       3  22.0      1      0   7.2500
1           1       1  38.0      1      0  71.2833
2           1       3  26.0      0      0   7.9250
3           1       1  35.0      1      0  53.1000
4           0       3  35.0      0      0   8.0500
..        ...     ...   ...    ...    ...      ...
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [125]:
df.select_dtypes(include='object') # select only object columns

        sex embarked    who  embark_town alive
0      male        S    man  Southampton    no
1    female        C  woman    Cherbourg   yes
2    female        S  woman  Southampton   yes
3    female        S  woman  Southampton   yes
4      male        S    man  Southampton    no
..      ...      ...    ...          ...   ...
886    male        S    man  Southampton    no
887  female        S  woman  Southampton   yes
888  female        S  woman  Southampton    no
889    male        C    man    Cherbourg   yes
890    male        Q    man   Queenstown    no

[891 rows x 5 columns]

In [126]:
df.select_dtypes(include='category') #select only category column

      class deck
0     Third  NaN
1     First    C
2     Third  NaN
3     First    C
4     Third  NaN
..      ...  ...
886  Second  NaN
887   First    B
888   Third  NaN
889   First    C
890   Third  NaN

[891 rows x 2 columns]

In [127]:
df.select_dtypes(include='bool') #select only boolean column

     adult_male  alone
0          True  False
1         False  False
2         False   True
3         False  False
4          True   True
..          ...    ...
886        True   True
887       False   True
888       False  False
889        True   True
890        True   True

[891 rows x 2 columns]

In [128]:
df.select_dtypes(include='int64') #select only int64 column
#df.select_dtypes(include='dateandtime') #select only dateandtime column: if this col available

     survived  pclass  sibsp  parch
0           0       3      1      0
1           1       1      1      0
2           1       3      0      0
3           1       1      1      0
4           0       3      0      0
..        ...     ...    ...    ...
886         0       2      0      0
887         1       1      0      0
888         0       3      1      2
889         1       1      0      0
890         0       3      0      0

[891 rows x 4 columns]

In [129]:
#4.2.1 selection ka dosra triqa : DROP METHOD
df.columns #columns names

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [130]:
# df.drop(['age','fare','sex','parch'], axis=1, inplace=True) # 0 = rows, 1=col
# or df=df.drop(['age','fare','sex','parch'], axis=1) #  both same result ,df upadtes

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [132]:
# deck has only 203/891 values so it may disturb cal , hence drop it
df.drop(['deck'],axis=1, inplace=True) #drop deck column

In [133]:
#deck still exist after drop, so use inplace=True in above cell
df.columns # if deck column is dropped

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [134]:
df1= df.T # data transpose (google what is transpose), depends on need

In [135]:
df.shape

(891, 14)

In [136]:
df1.shape

(14, 891)

In [140]:
# select based on specific value
df.head()
kurian= df[df['sex']=='female'] #show females details

In [143]:
kurian.shape # op main 14/15 col main females thi, aik main ni, yehi unique point ky kis column main females ni
df.columns # output main deck ka col ni, wo hum ny khud delete kia so no uniqueness in female point only 14 colunmns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [144]:
# select based on specific value
df.head()
munday= df[df['sex']=='male'] #show males details

In [148]:
munday.shape
munday

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [149]:
kurian.shape # kurian ny 314 rows capture ki hoi or munday ny 577
kurian

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False

In [153]:
londay=df[df['sex'] != 'female'] # alternative method to extract londy=munday
londay

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [156]:
# age ki base pr adult selection age>18
df[df['age']>=18]  # output 601 adult bi, matlb bachy bi thy jb titanic doba

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [160]:
df['age']>=18 # it takes it as condtion true or false , 1D

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: age, Length: 891, dtype: bool

In [169]:
#more explore
df[df['age'] >= 18] # now dimension increse kr di hy,df[df means 2D

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [173]:
# if only male data required  then
df[(df['age'] >= 18) & (df['sex']== 'male')]
# if want fare > 50
df[(df['age'] >= 18) & (df['sex']== 'male')&(df['fare'] > 50)] #sirf wady or ameer munday

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,Southampton,no,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,Southampton,no,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,Cherbourg,no,False
35,0,1,male,42.0,1,0,52.0000,S,First,man,True,Southampton,no,False
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,Cherbourg,no,False
62,0,1,male,45.0,1,0,83.4750,S,First,man,True,Southampton,no,False
72,0,2,male,21.0,0,0,73.5000,S,Second,man,True,Southampton,no,True
74,1,3,male,32.0,0,0,56.4958,S,Third,man,True,Southampton,yes,True
92,0,1,male,46.0,1,0,61.1750,S,First,man,True,Southampton,no,False
97,1,1,male,23.0,0,1,63.3583,C,First,man,True,Cherbourg,yes,False
102,0,1,male,21.0,0,1,77.2875,S,First,man,True,Southampton,no,False
110,0,1,male,47.0,0,0,52.0000,S,First,man,True,Southampton,no,True
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,Cherbourg,no,False
120,0,2,male,21.0,2,0,73.5000,S,Second,man,True,Southampton,no,False
124,0,1,male,54.0,0,1,77.2875,S,First,man,True,Southampton,no,False
137,0,1,male,37.0,1,0,53.1000,S,First,man,True,Southampton,no,False
139,0,1,male,24.0,0,0,79.2000,C,First,man,True,Cherbourg,no,True
155,0,1,male,51.0,0,1,61.3792,C,First,man,True,Cherbourg,no,False
169,0,3,male,28.0,0,0,56.4958,S,Third,man,True,Southampton,no,True
224,1,1,male,38.0,1,0,90.0000,S,First,man,True,Southampton,yes,False
245,0,1,male,44.0,2,0,90.0000,Q,First,man,True,Queenstown,no,False
248,1,1,male,37.0,1,1,52.5542,S,First,man,True,Southampton,yes,False
262,0,1,male,52.0,1,1,79.6500,S,First,man,True,Southampton,no,False
332,0,1,male,38.0,0,1,153.4625,S,First,man,True,Southampton,no,False
336,0,1,male,29.0,1,0,66.6000,S,First,man,True,Southampton,no,False
370,1,1,male,25.0,1,0,55.4417,C,First,man,True,Cherbourg,yes,False
373,0,1,male,22.0,0,0,135.6333,C,First,man,True,Cherbourg,no,True
377,0,1,male,27.0,0,2,211.5000,C,First,man,True,Cherbourg,no,False
385,0,2,male,18.0,0,0,73.5000,S,Second,man,True,Southampton,no,True
390,1,1,male,36.0,1,2,120.0000,S,First,man,True,Southampton,yes,False
434,0,1,male,50.0,1,0,55.9000,S,First,man,True,Southampton,no,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,Southampton,no,False
453,1,1,male,49.0,1,0,89.1042,C,First,man,True,Cherbourg,yes,False
484,1,1,male,25.0,1,0,91.0792,C,First,man,True,Cherbourg,yes,False
505,0,1,male,18.0,1,0,108.9000,C,First,man,True,Cherbourg,no,False
509,1,3,male,26.0,0,0,56.4958,S,Third,man,True,Southampton,yes,True
544,0,1,male,50.0,1,0,106.4250,C,First,man,True,Cherbourg,no,False
587,1,1,male,60.0,1,1,79.2000,C,First,man,True,Cherbourg,yes,False
599,1,1,male,49.0,1,0,56.9292,C,First,man,True,Cherbourg,yes,False
621,1,1,male,42.0,1,0,52.5542,S,First,man,True,Southampton,yes,False
645,1,1,male,48.0,1,0,76.7292,C,First,man,True,Cherbourg,yes,False
655,0,2,male,24.0,2,0,73.5000,S,Second,man,True,Southampton,no,False
659,0,1,male,58.0,0,2,113.2750,C,First,man,True,Cherbourg,no,False
660,1,1,male,50.0,2,0,133.6500,S,First,man,True,Southampton,yes,False
665,0,2,male,32.0,2,0,73.5000,S,Second,man,True,Southampton,no,False
671,0,1,male,31.0,1,0,52.0000,S,First,man,True,Southampton,no,False
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,Cherbourg,yes,False
681,1,1,male,27.0,0,0,76.7292,C,First,man,True,Cherbourg,yes,True
690,1,1,male,31.0,1,0,57.0000,S,First,man,True,Southampton,yes,False
698,0,1,male,49.0,1,1,110.8833,C,First,man,True,Cherbourg,no,False
712,1,1,male,48.0,1,0,52.0000,S,First,man,True,Southampton,yes,False
724,1,1,male,27.0,1,0,53.1000,S,First,man,True,Southampton,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,Cherbourg,yes,True
741,0,1,male,36.0,1,0,78.8500,S,First,man,True,Southampton,no,False
745,0,1,male,70.0,1,1,71.0000,S,First,man,True,Southampton,no,False
748,0,1,male,19.0,1,0,53.1000,S,First,man,True,Southampton,no,False
789,0,1,male,46.0,0,0,79.2000,C,First,man,True,Cherbourg,no,True
838,1,3,male,32.0,0,0,56.4958,S,Third,man,True,Southampton,yes,True
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,Southampton,no,True

In [175]:
df[(df['age'] >= 18) & (df['sex']== 'male')&(df['fare'] > 50)].shape # 59 wady or ameer munday

(59, 14)